Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.81/edc/PIC32MZ2025DAL176.PIC
      <edc:SFRDef edc:_addr="0x1F84B010" edc:_begin="0x0" edc:_end="0x1c" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCIMCON1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCIMCON1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SIGN0" edc:mask="0x1" edc:name="SIGN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF0" edc:mask="0x1" edc:name="DIFF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN1" edc:mask="0x1" edc:name="SIGN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF1" edc:mask="0x1" edc:name="DIFF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN2" edc:mask="0x1" edc:name="SIGN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF2" edc:mask="0x1" edc:name="DIFF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN3" edc:mask="0x1" edc:name="SIGN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF3" edc:mask="0x1" edc:name="DIFF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN4" edc:mask="0x1" edc:name="SIGN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF4" edc:mask="0x1" edc:name="DIFF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN5" edc:mask="0x1" edc:name="SIGN5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF5" edc:mask="0x1" edc:name="DIFF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN6" edc:mask="0x1" edc:name="SIGN6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF6" edc:mask="0x1" edc:name="DIFF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN7" edc:mask="0x1" edc:name="SIGN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF7" edc:mask="0x1" edc:name="DIFF7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN8" edc:mask="0x1" edc:name="SIGN8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF8" edc:mask="0x1" edc:name="DIFF8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN9" edc:mask="0x1" edc:name="SIGN9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF9" edc:mask="0x1" edc:name="DIFF9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN10" edc:mask="0x1" edc:name="SIGN10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF10" edc:mask="0x1" edc:name="DIFF10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN11" edc:mask="0x1" edc:name="SIGN11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF11" edc:mask="0x1" edc:name="DIFF11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN12" edc:mask="0x1" edc:name="SIGN12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF12" edc:mask="0x1" edc:name="DIFF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN13" edc:mask="0x1" edc:name="SIGN13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF13" edc:mask="0x1" edc:name="DIFF13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN14" edc:mask="0x1" edc:name="SIGN14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF14" edc:mask="0x1" edc:name="DIFF14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN15" edc:mask="0x1" edc:name="SIGN15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF15" edc:mask="0x1" edc:name="DIFF15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B014" edc:_begin="0x0" edc:_end="0x1c" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCIMCON2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCIMCON2" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SIGN16" edc:mask="0x1" edc:name="SIGN16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF16" edc:mask="0x1" edc:name="DIFF16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN17" edc:mask="0x1" edc:name="SIGN17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF17" edc:mask="0x1" edc:name="DIFF17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN18" edc:mask="0x1" edc:name="SIGN18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF18" edc:mask="0x1" edc:name="DIFF18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN19" edc:mask="0x1" edc:name="SIGN19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF19" edc:mask="0x1" edc:name="DIFF19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN20" edc:mask="0x1" edc:name="SIGN20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF20" edc:mask="0x1" edc:name="DIFF20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN21" edc:mask="0x1" edc:name="SIGN21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF21" edc:mask="0x1" edc:name="DIFF21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN22" edc:mask="0x1" edc:name="SIGN22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF22" edc:mask="0x1" edc:name="DIFF22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN23" edc:mask="0x1" edc:name="SIGN23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF23" edc:mask="0x1" edc:name="DIFF23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN24" edc:mask="0x1" edc:name="SIGN24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF24" edc:mask="0x1" edc:name="DIFF24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN25" edc:mask="0x1" edc:name="SIGN25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF25" edc:mask="0x1" edc:name="DIFF25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN26" edc:mask="0x1" edc:name="SIGN26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF26" edc:mask="0x1" edc:name="DIFF26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN27" edc:mask="0x1" edc:name="SIGN27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF27" edc:mask="0x1" edc:name="DIFF27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN28" edc:mask="0x1" edc:name="SIGN28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF28" edc:mask="0x1" edc:name="DIFF28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN29" edc:mask="0x1" edc:name="SIGN29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF29" edc:mask="0x1" edc:name="DIFF29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN30" edc:mask="0x1" edc:name="SIGN30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF30" edc:mask="0x1" edc:name="DIFF30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN31" edc:mask="0x1" edc:name="SIGN31" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF31" edc:mask="0x1" edc:name="DIFF31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B018" edc:_begin="0x0" edc:_end="0x1c" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="1" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCIMCON3" edc:desc="" edc:impl="0xffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="ADCIMCON3" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SIGN32" edc:mask="0x1" edc:name="SIGN32" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF32" edc:mask="0x1" edc:name="DIFF32" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN33" edc:mask="0x1" edc:name="SIGN33" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF33" edc:mask="0x1" edc:name="DIFF33" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN34" edc:mask="0x1" edc:name="SIGN34" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF34" edc:mask="0x1" edc:name="DIFF34" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN35" edc:mask="0x1" edc:name="SIGN35" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF35" edc:mask="0x1" edc:name="DIFF35" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN36" edc:mask="0x1" edc:name="SIGN36" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF36" edc:mask="0x1" edc:name="DIFF36" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN37" edc:mask="0x1" edc:name="SIGN37" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF37" edc:mask="0x1" edc:name="DIFF37" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN38" edc:mask="0x1" edc:name="SIGN38" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF38" edc:mask="0x1" edc:name="DIFF38" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN39" edc:mask="0x1" edc:name="SIGN39" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF39" edc:mask="0x1" edc:name="DIFF39" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN40" edc:mask="0x1" edc:name="SIGN40" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF40" edc:mask="0x1" edc:name="DIFF40" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN41" edc:mask="0x1" edc:name="SIGN41" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF41" edc:mask="0x1" edc:name="DIFF41" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN42" edc:mask="0x1" edc:name="SIGN42" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF42" edc:mask="0x1" edc:name="DIFF42" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN43" edc:mask="0x1" edc:name="SIGN43" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF43" edc:mask="0x1" edc:name="DIFF43" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
